//Object.preventExtensions() - метод використовується для запобігання додаванню нових властивостей до об'єкта. Це позначає об'єкт як нерозширюваний, гарантуючи, що його структура залишається фіксованою. 

// Запобігає додаванню нових властивостей
// Але дозволяє змінювати існуючі
// Незворотність: не можна повернути обʼєкт до стану розширюваного
// Ефект поверхневого розгортання: Object.preventExtensions() впливає лише на верхній рівень об'єкта; вкладені об'єкти всередині нього залишаються розширюваними, якщо preventExtensions()до них окремо не застосовуватимуться подібні методи.

const human = {
    name: "Alex",
    age: 26_169_017,
    isDev: true
};
Object.preventExtensions(human);
human.name = "John";
console.log(human);