// slice метод створює новий масив з частини оригінального масиву
// швидкість виконання O(n)
// повертає новий масив
// slice не змінює оригінальний масив
// перший аргумент це індекс, з якого починається частина масиву
// другий аргумент це індекс, на якому закінчується частина масиву (не включаючи цей елемент)
// якщо другий аргумент не вказано, то повертається частина масиву від вказаного в першому аргументі елемента і до кінця масиву


const array = [1, 2, 3, 4, 5];
console.log(array.slice(2, 4));
console.log(array);