// sort метод сортує елементи масиву
// sort змінює оригінальний масив

const array = [5, 1, 3, 2, 4];
console.log(array.sort()); // за замовчуванням сортує елементи як рядки 

//--------------------------------
const array1 = [5, 11, 3, 2, 4];
console.log(array1.sort()); // тому що як рядки 11 передує 2

//--------------------------------

const array2 = [5, 11, 3, 2, 4];
console.log(array2.sort((a, b) => a - b)); // сортує елементи як числа
/* цей метод працює таким чином:
якщо a - b менше 0, то повертається від'ємне число а отже a передує b
якщо a - b більше 0, то повертається додатне число а отже b передує a
якщо a - b дорівнює 0, то a і b рівні
*/