// flat метод розгортає масив на один рівень
// повертає новий масив
// не змінює оригінальний


const array = [1, 2, 3, [4, 5, 6, [7, 8, 9]]];
console.log(array.flat());

//--------------------------------

const array1 = [1, 2, 3, [4, 5, 6, [7, 8, 9]]];
console.log(array1.flat(2));

//--------------------------------

const array2 = [1, 2, 3, [4, 5, 6, [7, 8, 9]]];
console.log(array2.flat(Infinity));

//--------------------------------

const array3 = [1,,[2,,3]].flat() // порожні значчення видаляються
console.log(array3); 