// splice метод видаляє вказану кількість елементів з масиву і за потреби додає нові елементи замість них
// перший аргумент це індекс, з якого починається видалення
// другий аргумент це кількість елементів для видалення
// третій аргумент це елементи для додавання
// швидкість виконання O(n)
// повертає масив видалених елементів
// splice змінює оригінальний масив

const array = [1, 2, 3, 4, 5];
console.log(array.splice(2, 2));
console.log(array);
console.log(array.splice(2,1,3))
console.log(array);