// map метод створює новий масив з результатом виконання функції для кожного елемента масиву
// швидкість виконання O(n)
// повертає новий масив
// map не змінює оригінальний масив
// 1:1 відповідність елементів (довжина не змінюється)
// порядок зберігається

const array = [1, 2, 3];
console.log(array);
console.log(array.map(item => item * 2));

//--------------------------------

//перший аргумент це елемент масиву
// другий аргумент це індекс елемента
// третій аргумент це масив
console.log(array.map((item, index, array) => {
  return item * 2;
}));

// --------------------------------

const array1 = [1,,3]
console.log(array1.map(x => x * 2));
// map пропускає порожні слоти, але зберігає їхню структуру.